{
    "date": 1693150909825,
    "comments": [
        "Arteta really needs to stop playing around with these ridiculously overthought line ups and tactics.. play the back 4 that done us so well last season ffs! Partey isn't a RB in any form and play to our strengths. Absolutely fuming with that result, fair play Fulham but Arteta has to take the blame for that",
        "Overthought? I say clueless lineups.",
        "Havertz 65 million!Arteta get a decent striker. Wrong team selection?",
        "Infuriating as a fan. It was glaringly obvious it almost hurt that we needed a genuine no.9 who has a track record of scoring consistently. Instead we waste 65m on Havertz.. baffling",
        "Thank you Fulham.",
        "Poor old Arteta! If you had any wisdom you should have taken the PSG job. Arsenal will never repeat the feat of the last pl season for a long-long time to come.",
        "Havertz another of a long line of flops bought from Chelsea.",
        "We can't thank you enough",
        "£65m has been squandered on a player who can’t even read the game.",
        "He’s a shocking player. £65 mil of 💩",
        "Hard to deny I am concerned with the level of performance so far this year. I trust arteta and he's certainly earned the right for us to trust in him but some questionable team decisions at the moment. Get Gabriel back in at CB and white back at RB. Partey back in midfield and KH to the bench. Early days but need to shape up. Big game next week now!",
        "Arteta reckons he's Pep",
        "Entirely Arteta's fault this result.",
        "No recognised left back in the team and we let one of the best in the league  go on loan to Spain…In Arteta we trust, but I’m struggling understand…",
        "Havertz why ????",
        "Chelsea FC says thank youuuuuu",
        "ARTETA got it wrong",
        "Has he gone back to the pre 2022-23 Arteta?",
        "To take Odegaard off and bring in Jorginho in a bid to see the game out against a team that has just gone one man down shows lack of ambition and sadly we got what we deserve…..A late equaliser and one point.",
        "Baffling from Arteta, backing off allowing 10 men to control the game and equalise, Arsenal’ve been riding their luck first three games, Arteta needs to go back to basics and play his best 11, Havertz need to be benched.",
        "fulham deserved that. played well.",
        "Fulham kept going and didn't give up. This team will have another good season if they continue like this.",
        "Good for football to see an outfit like Fulham hold a side who spent 100m on one player... let's hope this continues",
        "Once Declan Rice recovers from injury you'll see a new Arsenal.",
        "What a result Fulham. Great point.",
        "Boy, did we need that after last week. Messy pre/early season preparations have taken their toll, but its largely the same team as last season, so confident that as things settle down we'll be solid enough, as shown today. 3 or 4 quality additions before the window shuts and we should be OK.",
        "A classic case of snatching defeat from the jaws of victory!I AM FUMING!!BTW Good fight by Fulham but still...",
        "Bad sportsmanship by arsenal don't ever start moaning when it happens to you",
        "Had an extra man Had an extra 10 minutes Had the refs help Have a more expensive team And with all that can only scrape a draw",
        "Had home field advantage.",
        "Absolutely brilliant! Are the gooners the new Spurs?Ha ha ha.Well done Fulham!",
        "I shouldn't think so, after all we have won Championships and Trophys, what have you won? Nothing.",
        "Referee tried his best for Arsenil but he wasn't quite good enough today!",
        "What were you watching",
        "Spent£170 m on a forward who can’t score and a non creative , non scoring midfielder , priceless😁😁",
        "That is why the term 'Buyer Beware' exists.Ignore it at your peril.",
        "Just play your best available back four, ya best available midfield and ya best 3 available forwards and stop playing players out of position just to shoehorn a someone into the team that has little to no effect on the game.",
        "Thats what happens when you buy high priced stars, the pressure is there to play them, even if there is no place for them in the side or there is currently someone who is actually better fit at the moment.",
        "What's your excuse Arsenal?",
        "Arteta is a genius I don't care what anyone says!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "Well deserved, Fulham👏👏👏",
        "A draw, and you are celebrating that? If they were as good as you seem to think they are , then surely they should have won!",
        "Excellent fight from Fulham— it’s not easy playing 11 v. 12 and then 10 v. 12.",
        "The second goal should not have stood. Clear foul in the buildup",
        "Bet Arsenal fans are wishing they spent that Havertz money differently. Or just trusted Viera a bit more.",
        "If Havertz couldn't make it at Chelsea what makes Arsenal think he can make it for them? No wonder Chelsea were over the moon to see him go.",
        "Catastrophic transfer window; timber out for the season, rice overpriced, and Chelsea still laughing all the way to the bank for achieving 60m on havertz.",
        "Chelsea may be laughing all the way to the bank but the manager of that bank isn't looking amused given the huge outlay on mediocrity!",
        "Well done Fulham great team spirit shown more so after the disgusting sportsmanship shown by arsenal Could you just imagine the outcry if Fulham had done that yo arsenal cry baby arteta wouldn't stop moaningArsenal beware when it happens to you don't cry foul play",
        "He’ll pull a Wenger and say he didn’t see it😉",
        "All that money And still no better offWas Rice playing Asking for a friend",
        "I don't believe you have any friends.",
        "Great result for the Fulham reserves",
        "I can’t believe we have the same manager! Last season he was excellent! This season he has lost the plot! Players out of position! I can only think that they play Havertz because they need to justify the ridiculous amount they paid for him!",
        "Last season was their Leicester moment, they bottled it. Now it's back to being Arsenal!",
        "Well, I hope some Arteta fans are having some humble pie now.....this guy is now getting drunk on power - thinks he's arrived after last season, enjoy the power trip he's now on, doing ridiculous things...",
        "Spot on!",
        "Well done Fulham with ten men. Penalty came when Arsenal needed one",
        "The penalty came when a Fulham player committed a foul in his own penalty area, not sure that Arteta had planned that into his game plan!",
        "Oh dear oh dear oh dear🤡🤡🤡🤡🤡🤡🤡🤡🤡",
        "Imagine these lot in the UCL.",
        "Going out in the first round",
        "Still waiting to see what Havertz actually does",
        "Havertz overated",
        "Cannot understand what Arteta is thinking.All he had to do with todays players availability is put Rice in the place of last years Xahka (probably spelt that wrong) and keep the team same as last year.",
        "Totally agree. Playing 2 number 10’s in front of Rice is plain lunacy or arrogance",
        "Was Arteta having a tantrum ?",
        "Always, just always",
        "Great result for Fulham. Just a pity they didn't win.",
        "Why didn't they win? Because they scored the same amount of goals as Arsenal.",
        "Last season, Arsenal would have comfortably won this game. Every game this season, Arsenal have looked vulnerable for long spells against teams that last season they would have comfortably beaten - no messing. Strangely, Merse said City are a fading side’. On the evidence of these three games, Arsenal are the side that’s fading. Worrying for Arsenal fans - especially given the colossal spending.",
        "Arsenal failed too beat Southampton, West Ham and Forest in the last few games of last season I seem to remember. There is a pattern here.",
        "Well done Fulham",
        "Why all the tinkering, RB is a joke, no starting centre forward.To top it off, eased off when Fulham down to 10.As for Havertz, I’d let him go on a free transfer just to get him off the wage bill.",
        "Fulham were robbed never a booking so never a sending off, the goons already found out.",
        "Arsenal were good with Ball but great teams are good with out it and Arteta should know that, Fulham deserved their point and maybe all of them.",
        "Awarding points according to what is deserved is the scoring system that is used in figure skating and ball room dancing, in football it is about scoring at least one more goal than the opposing team. Which Fulham failed to do.Please explain how you would have scored the match and how you arrived at that outcome?",
        "Thank you Havertz. From a Fulham Fan :)",
        "Well played fulham",
        "Well played? They drew! Surely a win would have warranted a 'Well played'!",
        "I reckong the added time board went from 3 to 9 as soon as Fulham scored. Never seen a team have so much time added on when needed as Arsenal, even United were not this bad under Ferguson",
        "And yet United got 9 mins at OT at the same precise moment this afternoon. It's the new rules mate, best you go read about them.",
        "I’m a fan of Arteta. He did wonders last season, but this feels like a defeat. A Fulham team minus their best defender Ream, and best attacker Mitrovic should have been beaten. This is totally down to Artetas bizarre team selection. All Arsenal fans were completely baffled when they saw the starting line up, with at least 4 players selected in the wrong positions. Down to you Arteta",
        "Unfortunately Arteta believes he is the special one.",
        "Surely Arsenal will soon revert to their default settings. Too much hype.",
        "Hahahahaha Arsenal!!!!!!!!!!",
        "Haha declan rice is the most overrated and overhyped footballer in the world right. He was so anonymous in midfield and got outclassed by the fulham midfielders. Arsenal fans should stop giving him a high ratings on the BBC.Arsenal were lucky today if it wasn't for the sending off and penalty are would have lost but they will lose to manutd when they come to the emirates next week.",
        "Tell me you know nothing about football without telling me you know nothing about football. Rice was sublime.",
        "Reading all the reviews on BBC sport before the game you'd have thought Arsenal won the treble last season not City.",
        "According to Arteta…Arsenal were ‘10 x times (at least) better today than last year’What a stupid and deluded thing to say…",
        "Yep it is such a stupid comment.",
        "Look on the bright side Arsenal supporters! At least you won’t have to worry about winning the Premier League this season! Arteta is making sure you won’t!",
        "Harvest very slow . Start the game without striker I think ARTETA is responsible about losing 2 point",
        "Arteta is to blame 100% for this resultArsenal was much the better team and played pretty well but to defend like they always do when they take the lead is the wrong way to play football.Fulham played very well today, was a mismatch in how good they are so getting a point and with 10 men big respectOne last thing, good to see Saka taking pens againFrom Chelsea fan",
        "Good result for Fulham this. Arsenal dropping points at home. Not good for a title challenge. 😁👍",
        "Arteta will NEVER win the league. Too far up himself, what has he done with Tierney and why waste money on Hevertz?",
        "Apparently there’s been some sort of leak from the Arsenal management team, and they’ve somehow got hold of the Arsenal line up for the United game next Sunday.  Jesus is in goal , with Saka at centre half. Kiwior is on the left wing, with Holding as midfield play maker. Looks all wrong to me, but what do I know ?",
        "Banter FC...Not even Christmas Champions this season.Well played Fulham, deserved all three points.",
        "Big point for Fulham. 2 dropped for Arsenal against 10 men. Arteta's press conference will be interesting. I wonder who's fault this will be?",
        "Bottled ot early this year",
        "Kai what a disaster",
        "Boehly is a genius in disguise",
        "Bottled it already? The goonies way",
        "Excellent that lego headed pellet Arteta dropping points.",
        "Lol lego headed.",
        "Woolwich Wanderers has BOTTLED it again.... On 26/8/23 the small club from Woolwich ( Claiming to be massive despite ZERO European pedigree) has showcased again why it can't be trusted if you want to make money by betting. This time it happened against 10 men Fulham despite taking the lead for the tinpot club from Woolwich also known as Arsenal.",
        "Loads of stuff here about Arsenal - Arteta getting tactics all wrong, Havertz a waste of money etc etc ad nauseam . How about how good Fulham were, getting a well deserved point away to one of the title favourites with 10 men for part of the game ? The elitism of the Premier League,replicated week in and week out on threads like this, really annoys me.",
        "Well said. Disrespectful HYSers week after week",
        "Don't get too excited Fulham. It's only Arsenal.",
        "Did Fulham finish seeing last season?",
        "there isn't a manager in the game as unlikeable as Arteta, plenty of candidates, but he's the most tedious",
        "You don't have to popular or nice to be a successful manager. But he does behave like a spoiled kid at times",
        "Couldn’t have had a kinder start - Forest, Palace & Fulham, with 2 out of 3 at home too, yet unconvincing and failed to take maximum points. Hope you enjoyed last season Arsenal fans, cos that’s the closest you’ll get to a title for some time.",
        "Is it March already ?",
        "Arsenal fans in full meltdown after a draw 3 matches in, they really do think their the best team in the land.",
        "Arteta is a second class manager that is the reality.",
        "The man is a legend. There will be an Arteta stand at the Emirates one day. Building a legendary team - still a work in progress, but they will win the title this season",
        "Always said if goal shy Rice was 100m then Paulhina ( most tackles in EPL last season ) should be 150m . Now let's strengthen our threadbare squad and aim for another top half season. COYW",
        "West Ham and Chelsea mugged Arsenal for the fees they paid",
        "Get the bottling started early !🙏",
        "just asking what does 60+55  come too.",
        "Thanks for buying Declan Rice. He was turning into another Mark Noble with his safe sideways and backwards passing.  I see he gave the corner away for the second goal and was taken off - sorry, I can't help smiling",
        "Either very brave or very stupid coming on here when your teams about to kick off in about 10 minute, hopefully I'll be back to return the favour.",
        "Vieira managed to do more in 30 minutes than Havertz has done in 3 games! Absolute masterclass and really showing why we paid for him. Takes some players some time to acclimatise, for Fabio it was bulking up and learning the language. Hope he plays alongside Rice and Odegaard for the next match.",
        "Vieira did more in 3 minutes, but in fairness Vieira only had to walk onto the pitch to achieve that.",
        "Title contenders? Can't beat 10 man Fulham at home 😂😂😂",
        "PALHINHA!!!",
        "If Arsenal's owner is expecting Arteta to go one better this season they will be sorely disappointed. The stars alligned for them for most of last season but to expect it 2 seasons on the bounce is expecting way too much.Regardless of how much money is spent, Arteta is not good enough.",
        "I sometimes  sing  adam...west....adam west.Other times i sing dinna dinna batman...especially  when arsenal  draw or drop points.",
        "me and bertie tonight down  the kings rd for a party up the fulham",
        "Would that by any chance be with Bertie Magoo the bitter blue ( City).",
        "Fulham 6 fouls 7 yellow cards, Arsenal 5 fouls no yellow cards. Consistency on yellows for \"time wasting\" needs to be sorted out. How long is time wasting?",
        "Stupid tactics from Arteta, tactically inept..Play defenders at the back and forget this invert rubbish.. You are not Pep..",
        "You don’t always get what you deserve but if you try then sometime you do. To all the jeering Arsenal fans. We love Fulham",
        "Will the Arsenal fans be taking the michael out of Spurs fans tonight?I think not.",
        "It’s one game, have a word.",
        "The 2 points lost rests entirely on Arteta. Trying to show what a genius he is.....and he isn'tTwo weeks in a row he fielded stupid lineups. Stubbornly refuses to play Balogun and Tierney on Personal dislikes. Balogun scored 22 Goals last year. Based on the past it will take Eddie 8 years to score 22 in total. Arteta cost us last Season playing Holding for 6 games none of which we won .",
        "Being a Chelsea fan i feel i have to say thank you sooooo much for buying Havertz from us. I am shocked other teams wanted to buy players like Havertz and Mount and few others when they was very bad playing for us. Well done Fulham to defend that well and score 2 goals and get a point with 10 men is huge respect from me. Will say its nice to see Saka taking pens after last week.",
        "Arteta is being found out-could be an absolute disaster for Arsenal this season",
        "The establishment club & their entitled fans are on the salty side tonight",
        "Arsenal bottlers !",
        "Nearly as bad as Bottlepool !",
        "Great result for 10 man Fulham the pride of West London. Joao Palhinha total class",
        "We ain’t winning no league 😢",
        "I think you are right but if you accept it early then life has more meaning and is easier to deal with",
        "Wasn't at your game, I was at Bournemouth. But my granddaughter, a gooner was, and she thought  Fulham were the much better organised team. She is like seaside rock, arsenal through and through, but can credit the opposition, unless it's my team, when it's due.",
        "Arteta trying to be smart, ends up looking like a tart",
        "He is a highly unintelligent fool",
        "Contrary to Arteta's belief that he is the \"special one\" he is about to become slowly aware that he is no more than a recently qualified assistant.",
        "Saying his squad is ten times better than last season is crazy. Wait until they actually perform before trying to convince people. Heaven only knows why Havertz. WHY?????",
        "Go it Fulham, it is so nice seeing a team punching above its alledged height.",
        "Haha",
        "Fulham fan here who actually went to the game.you arsenal fans baffle me.stop moaning.you have the best team you have had for years.on another day you win 5-0 had you taken your chances and Leno weren’t in goal.remember you have no define right to beat teams like us.cheer up 🙄",
        "Above arsenal without a striker.",
        "Move over LiVARpool - VARsenal are here to stay!If there was justice in the world, Arsenal would have a haul of three points so far. The fact that their fans are not rejoicing for the inflated seven against their name, suggests a deep disaffection.",
        "115",
        "Arsenal Fan TV should be worth a watch tonight.",
        "Claude (RIP) would have been good value tonight",
        "First it was Saliba, then he came back. Next it was £105 on a DM, then a new goalie, all to struggle against 3 supposedly “smaller” teams. Progress!",
        "Havertz is useles and a waste of money. Arteta played all players in a useless formation. Arteta, you just don’t get it, do you? As for Rice, he is over priced. So Arteta, if you have the guts to listen, get Partey back to mid field, play Rice in Xhaxa position and Zinney in Tiwor position. Bench Tiwor n good for nothing Havertz",
        "Zinchenko can't defend to Dave his life. He is useless at defending.",
        "I see Arsenal fans are taking the result in their usual calm and considered way. How long before we hear the cry for Arteta to go?",
        "Arteta Out !!!",
        "ARTETA OUT NOW",
        "I’m still confused as to why we signed Havertz. I thought it was s joke when we were linked with him!. Partey at RB, Gabriel on the bench - Arteta what are you doing?. Get Partey back in midfield, Havertz on the bench, Gabriel in at CB and White at RB and start building on our success last year - not eff it up!! Oh and buy a striker.",
        "But there is simply no money, 200m down the drain!!! They are having to offload like crazy. Arsenal does not have bottomless resources unlike its rivals",
        "Fulham deserved their point. Arsenal need a proper striker and Havertz is proving to be a shockingly expensive signing as all Chelsea fans knew he would be.",
        "We’ll the Kai Havertz era was short lived.",
        "Never proved himself in English football",
        "Partey at right back, what on earth is that all about???",
        "arteta doing a southgate?",
        "Arteta clearly doesn't know his best team and they are struggling with the changes each game",
        "Guess Fulham went All In then, but came away with a share of the spoils!Tony Khan may have to step out of his AEW bubble to help the team out.",
        "2-2....no doubt Arteta will his usual accurate analysis of how when Arsenal do not get 3 points against 10 men it has absolutely nothing to do with him.",
        "Well done Fulham, ref was playing until Arsenal scored but Fulham held out.",
        "Where is AFC Mickey 🤣🤣🤣",
        "Probably having his nappy changed.",
        "Another vintage Havertz performance!",
        "Following on from his iconic performances at Chelsea last season lol Always been a risk  purchase ,  purely on his  potential . Can describe in one word \" OVERATED\"",
        "Sorry Mikel, you got your tactics wrong once again. We can't always be lucky, so slow moving from the back, too many defensive mistakes. Havertz has been disappointing so far but you insist on playing him, he's obviously not ready yet. It reminds me of Willian whom you insisted on playing him for far too long. Playing like we did in the first three games will lead us nowhere, let alone in top 4...",
        "He should have signed Tielemens on a free instead of the useless Harvertz. Arteta is daft.",
        "Fulham played well, defensively we shot ourselves in the foot, giving away a penalty, then didn't compose ourselves after the penalty,, conceding a second. Also pleasing that a 'makeshift' team got a draw after having a player sent off. We really need to sign 5 / 6 players before the window ends.I can't see Arsenal winning the Premier League. There's something missing. ",
        "Centre forward & a back 4 made up of defenders helps",
        "Pep having a laugh at the scramble he's made of his lapdog's brain. I'm certain Arteta is having a chat for \"advice\" from Pep where he's just feeding him the absolute worst ideas he can come up with. Sitting back v 10-man Fulham like they are playing Citeh onlt the final day for the league. Arteta isnt up to the job. Too weak.",
        "Arteta",
        "We are playing Partey out of position at RB, White moved from his winning/overlapping partnership with Saka from last season, and have disrupted the CB pairing of Saliba and Gabriel 🤷🏻‍♂️why? To fit in rice and havertz. Should go back to basics, and simply put rice in the xhaka no8 position, save havertz for caribao cup.",
        "Not happy with Arteta then?",
        "Looks like Arsenal are bottling it early this year",
        "Use your full backs Arteta, that wasn’t total football it was total nonsense",
        "Rice £105m, rating 5.15...",
        "What do you expect when you buy ex-Chelsea players. The clue was when you were comfortably winning the league last year then you bought Jorginho.",
        "Terrible result. 2-1 up with a few minutes to go against 10 men and drop 2 points. Rediculous choices at the back. Partey should be in midfield instead of havertz (why did we get him instead of Maddison?) and then Kiwor at LB whilst Tierney allowed to go out on loan? Get Gabriel back in defence and white back to RB",
        "Redandwhiteiculous choices at the back surely? Ridiculous spelling. State of North London schools!",
        "Rubbish Havertz. He was useless at Chelsea.",
        "Wasn’t everyone",
        "I wonder if Spurs will end up above Arsenal this season? I never gave Fulham a prayer and they should have won it with ten men… Arsenal usually choke in April not August",
        "Arsenal wobbling like a bowl of jelly.",
        "I thought Havertz was poor yet again.",
        "I thought the Arsenal fans said Declan Rice would help them win the title😆",
        "Declan is a born loser",
        "Please ARTETA can you select the right team next time",
        "The bottlers have started bottling games early this season...🤣🤣🤣",
        "Yeh proper early normally kicks in after new year",
        "and that, ladies and gentlemen, shows why the Gunners have no chance of winning the title.",
        "I agree mate and I'm a Gooner. A shocking absence of footballing common  sense today. Why leave better players on the bench when you need to win games?",
        "When arsenal signed him I said he couldn't hit a barn door with a banjo and they didn't believe me 😂😂😂",
        "Arteta out! Get this overrated fool out of our club now!",
        "Arsenal were '10 times better' than last season says just Mikel Arteta. Everyone else says the opposite. Ever heard of game management? Arsenal totally backed off when they went 2-1 up and gifted Fulham the equaliser. 2 points lost by Arsenal, keep playing like that and you get no top 4 this season.",
        "Same old arsenal always cheating",
        "So what's new",
        "Ha ha ha ha ha ha couldn’t happen to nicer side, come on you lillywhites",
        "spurs will not be top 4 this season. tell me where's the kane replacement.",
        "Tough at the top , 10 man Fulham hold firm , well played. Ps Brighton will be prem league leaders by 7 pm tonight .",
        "Hmmm! A bold prediction, or should I say a guess, as they are 1-0 down at the moment. Or do you know something that we and the West Ham defence don't?",
        "The bottle job factory doors already starting to open…",
        "I love it!!! Opening abit early tbh!",
        "Ten times better, Arteta is having a laugh. Party at full back whilst he pushes Tierney out the door, he's got rocks in his head if he thinks either of those decisions make sense.",
        "We really are bottlejobs. Arteta trying to be too clever, never works out. The guy thinks he is playing FIFA or whatever it is now.",
        "Were the Arsenal players surrounding the referee and Arteta harassing the officials ?Asking for a friend",
        "Why ask - you know it's true",
        "Didnt get to game, listened on radio so my take on it is perhaps coloured by the commentary. Rice, Havertz were hardly mentioned but the season is only 300 mins old. 3 games in and knives are out. Rice will be an excellent acquisition even if he does play a bit like Ray Wilkins (The Crab). Not sure about Hav tho. He seems a rabbit in headlights. Kudos to Fulham. Arsenal will fin above Spurs MU Che",
        "Yes probably should have drawn palace and won this game. So on balance it’s still a reasonable tally",
        "Over celebrate that Mr Arteta.",
        "They went under everyone’s radar last year when no one took them seriously until it was far too late, but spending £170m on Rice and Havertz has got to be the biggest joke in EPL history! Can’t wait to see this mob get totally scorched in the Champions League! The glitch in The Matrix has now been fixed- Arteta and Arsenal are back to where they reallly should be- stumbling!😂😂😂😂",
        "Arteta is joking with that his experimental tactics and Harvertz.He's not physically strong and swift enough for an 8 and not prolific to be a 9.You have, Rice, ESR, Fabio and Zinko for a strong 8, then you rush in to bought problem (Harvertz) for yourself.Now we're trying to sell a promising striker to balance the books.",
        "We played 3 matches, not convincing in any of the matches. Poor in most friendly matches during the break.Spent 65 million on Havertz. He got no pace, looks tired, poor body language.Buy a decent striker. Jesus too many injuries.",
        "Jesus too many injuries? With a name like that, surely he should be able to heal himself.",
        "Arsenal's main problem is they have something akin to a rather large, spoilt child at the helm",
        "Arteta and Arsenal fans can suck it.",
        "Arsenal's team balance was horrific in the first two league games. Arteta learned nothing & continued to play Partey at RB, & again it didnt work... If he does it again, sack him, as his stubbornness is hurting the team. Why is Havertz starting? Never earned the right & just walks around the pitch looking disinterested..And why is Arteta publicly humiliating one of the best CB's in the league?",
        "It’s the worst keptSecret that Gabriel is leaving. Need to balance the books after wasting colossal amounts on 2 average players and 1 player who is now out for the season. This transfer market has been extremely damaging, dreadful recruitment. We will now play the whole season with no proper defensive backup after Tiermey also left. It’s absolutely shocking",
        "Classic arsenal 🤣",
        "Liverpool and Spurs fans crying because we took their Champions league spot. 3 games in and we are being written off. Love it!  Keep the hate coming, it means we've done something right.",
        "arteta is a wannabe of pep",
        "Arteta doesn't know what he was doing.",
        "Normality returns to north London...",
        "That's the end of Arsenal's challenge this season",
        "I used to chuckle to myself that Chelsea bought such a useless player in Havertz! Then for no imaginary reason we  pay £65million for him!!!!! Edu must have had his pockets lined for buying him! There can’t be any other reason!",
        "Is Arteta intent on screwing up what was the 3rd tightest defence last season ? What’s going on ? Gabriel ? Partey at full back ? Kiwior at left back ? Ben White at CB ?  Partey at fight back ? Tierney loaned to somewhere in Spain ?  Strange selections also in midfield and up front . Arteta don’t bother lecturing the players . Instead have a word with yourself .",
        "Who cares as long as he screws it up COYS",
        "It wasn't broken so why fix it? We bought in Rice as a massive upgrade for the Swiss. Timber is an upgrade to the defence- sadly injured. What on Earth does Havertz bring other than to take a much better player, Partey out of midfield into defence where he is clueless quite frankly. What is Arteta doing? He has lost the plot over useless Havertz!!!!!!!!!!",
        "I've never been this angry against this team. How in the world did they manage to screw this up? Leading 2-1 at home to a team that is one man down. The mentality of this team is in the gutter. 😡😡😡😡",
        "I hope someone at Arsenal has the guts to tell Arteta the truth. I mean seriously",
        "Only took Arteta a few games to be exposed as the fraud he is. Arsenal back to obscurity it is then.",
        "A result that you review in May and think \"What if?\" Why break up one of the most effective CB partnerships in the league? Why move one of the most effective RBs in the league to CB? Why move one of the best CDMs in the league to RB? Needless tinkering, IMO.",
        "Was a poor performance by Arsenal, seem not to be gelling this season, strange team set up in the first half We went ahead, team just sat back, giving 10 man Fulham a chance, which they duly took.Some bad ref/linesman decisions clear fouls not given, Leno was out the box when he collected the ball..I rewind it, looked at slow motion. I said they will not a reply of that, as VaR is wrong….AGAIN",
        "Even Odegaard goal that was ruled out - did that go to VAR for offside as that looked pretty close. And the Leno catch def looked outside the box, again all we ask is a closer look!",
        "Shame Shirley’s son got sent off",
        "Arteta is an absolute clown. Overly emotional and childish on the touchline, idiotic with tactics (starting a home game without a proper centre forward) and, judging by his claim the team are \"ten times better than last year\", completely delusional. Arsenal to go backwards this year; they'll probably struggle for top 4 with Arteta in the dugout.",
        "Tierney and white need to be be at LB And RB respectively next week with Gabriel at CD. Then move partey into midfield for Havertz. Vital matches coming up and we need our best players playing - not experimenting just to include a new 65m toy",
        "Wait. Toerney has left the club",
        "Hopefully City can do well in the Champions League again this season, these mugs along with Newcastle could ruin our coefficient.",
        "Clueless ref,who doesn't even know the rules.Watch Calvin Bassey's first Yellow card,time wasting at a goal kick.An Arsenal player is stood in the box, Bassey does not have to take the goal kick,until the Arsenal player leaves the box.",
        "Sorry but I don't think we are anywhere near premier league champions, same mistakes as last year giving goals away in the same fashion as last year, I don't think the squad is any stronger than last year we should have held on to Xhaka need a proven goalscorer, we play some good football but need to be more direct sometimes.",
        "Arteta is clueless. Havertz is useless to them core and Arteta played him for 3 weeks! 2-1 up and one man extra and Arteta replaced Odegard and the team became leaderless. Rice is overrated. Kiwor is like Eleny. Hopeless.",
        "Arsenal overachieved last season …… back to 8th in the table this season",
        "This idea of using partey as an extra midfielder posing as a right back...Is not working..Need to put Gabriel back in the back four and secure our goal.Surely they won't try it again against UTD.",
        "Arteta probably will. Drop Havertz. He’s been poor the past few games.",
        "I’ve never seen a manager trying so hard to destroy his out team smh",
        "Awful refereeing. Saka foul before the second goal holding on and pulling the defender down. Then dirty Arsenal playing on when a player is properly injured. Awful club",
        "Trying to keep up with City Arteta wants to emulate Pep by tinkering with the line-up and formations. One step at a time hey ol chap. Just desserts today and Fulham totally deserved a point",
        "It's just deserts.",
        "Easy 6 points here for Newcastle when they play Arsenal.",
        "Log",
        "Fair play to Fulham that was a great game and a well deserved point for them. Arteta & Arsenal on the other hand.... Where do I start. I'm not impressed with these tactics. Havertz shouldn't be starting just yet, Partey should leave RB it's not in his job description, and Gabirel and Saliba are OUR BEST defensive pairing, anyone can see that except for the manager that figures...",
        "who is better value for money ? £104 m Rice or £30 m  Madison? Havertz plays as a forward for Germany, but B. Munich did not even consider him for the bench.He played for Chelsea the same way he is playing for Arsenal. Buying Jorginho and Havertz from Chelsea to improve a team that lost 8 points lead in April & May. Nketiah is average . Arsenal are good for top 6 this year.",
        "Rice",
        "But mommy we are 10 x better than last year it's so unfair....",
        "Get Gabriel back in defense, he’s quality and his distribution is better than Saliba’s. Those two together are great. Havertz looks short on confidence. He runs into space after the pass he doesn’t anticipate. On this showing Viera is streets ahead as I’m sure ESR is too. Feel sorry for Trossard finally gets a chance and has to play out of position!!!",
        "Havertz is a busted flush",
        "Marco Silva doesn't get the respect he deserves",
        "He would be an upgrade on arteta",
        "2nd in the league to the mighty Spurs.",
        "BOTTLERS",
        "And bought two perennial bottlers  in Rice and Havertz",
        "Arteta has taken Arsenal from second best in league to second rate. His stubboness is legendary, Havertz was useless at Chelsea, and has ruined Arsenal. Playing him means decent players missing out and stupid formations. Partey is not a full back. ESR should be in Xhaka role. Havertz got rid of, he make Pepe look world class.",
        "Lovely late equaliser. Just lovely.",
        "The other someone wanted to nail me on the stake over the Arteta tactics and player's management.I'm wondering wat went wrong wit the last season lineup. Why the change? Simply cos you want to contain your 65M player. Wat happens to Gabriel/Salliba pairing or the White/Saka threat??Supporting arsenal is definitely not good for my health.",
        "Kai Havertz.Words cannot describe how much I dislike Kai Havertz.What a total and complete and utterly useless waste of money.It was just a shame that Timber was the one who got injured - he would have brought so much more to Arsenal than Kai Havertz.",
        "That’s a lil bit nasty wishing a injury on someone… you sure you not a spurt, cause that’s their level",
        "Bottling starting early",
        "Bunch of bluffers & bottlers",
        "London no bottle squad !",
        "I can see Man City doing the double over  Arsenal, again an easy 6 points.Does Arteta play the card game twist, just as well as he would twist on 21",
        "can't beat a fulham side 2-1 ahead down to 10  and you think you got any chance of winning the league hahahaha 2-2",
        "Arteta is just like Pep but without the tactical nouse, football knowledge, charm and charisma…… and of course the trophies",
        "Lol",
        "Good result for Fulham ending the game with 10 men, plus Arsenal had 11 for most of the second half by taking Havertz off.",
        "Typical Arsenal supporters one blip and the manager is an incompetent imbecile…when a week earlier he was the best thing since sliced bread…😂😂",
        "The Spurts the manager now, if he remains there till the end of the season he will be the first since Podgy…have a think about that.Why because spurts are a disgusting disloyal club, with matching fans Think during AW you had 14/15 different mangers to our 1Why because spurts are a disgusting disloyal club, fans to match I’m not sure there any club in England to match spurts disloyalty",
        "Is this the same Arsenal that is supposed to challenge Citeh for the title?🤣🤣🤣🤣🤣",
        "Arsenal finishing 8th this season",
        "A red card and a penalty decision in their favour and still can't gerlt the job done. Wonder who arteta will blame, the Saudi transfer window?",
        "I just love reading arsenal fans whinge whinge whinge it actually makes you realise why arsenal don't perform as a champion team..the fans are such a set of whingers",
        "Entertainment for the neutral ! 😂",
        "Three games in and bottling it already.",
        "Good for you.What position did you play?",
        "Migel Whats wrong with Smith Rowe. Why has he not been given a look, are you afraid to give British players a chance unless you cant ignore them. We all know that Eddie will go straight back to the bench when Jesus returns.",
        "Arsenal back to their bottling best",
        "After 3 games. Behave.",
        "Can't even win against ten men,  finishing above Spurs for the first time in seven seasons looks like being the high water mark for the hapless goons.",
        "Tottenham the smaller club. Arsenal the bigger, better club. More trophies."
    ]
}